{"status":"ok","speakers":[{"id":1,"name":"Max Furmanov","company":"Accenture, USA","bio":"Max is a Global Managing Director leading both Accenture’s Emerging Technology practice and network of Liquid Application Studios. Max’s teams are responsible for R&D, innovation thought leadership and delivering pioneering engagements to disrupt how our clients run their business.","session_title":"New IT: Transforming Software Engineering","session_text":"Enterprises today are at an inflection point. Their legacy platforms are slowing them down and their tooling & practices have reached the limit of their effectiveness. At the same time more and more ‘real-world’ products and services are evolving into software making technology a key differentiator rather than an enabler of the business. Hear about how leading companies are applying new arch technologies, automation, and lean engineering practices to accelerate innovation and shift to the New IT.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/furmanov.jpg"},{"id":2,"name":"Shashin Shinde","company":"Red Hat","bio":"Chief Architect for EMEA Strategic Business Development","session_title":"Open Source Innovation for Business","session_text":"We will be focusing on open source model for technology innovation and how it helps the business aspect in general. We will highlight Red Hat strength: Open Source way of creating products, talk about what we offer in terms of products and technology as an alternative and also highlight key differentiators we have in terms of technology strategy and vision.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/shinde.jpg"},{"id":3,"name":"Fabien Papleux","company":"Accenture, USA","bio":"Fabien leads the IOT Engineering practice globally for Accenture. He is also the IOT and Prototyping Capability Lead of the Liquid Studio in Redwood City, CA.He started working on the Internet Of Things in 2010 on the largest IoT project the firm has ever conducted. He is also the main author of the Accenture Reference Architecture for IoT and he is the creator of the patent-pending Accenture Rapid Prototyping Platform used to model IoT use cases in a matter of minutes,","session_title":"Architecting for the Internet of Things","session_text":"The Accenture Reference Architecture for IOT is a tool used to design new architectures and assess existing ones regardless of the specific vertical they implement. It is based on experience and latest technology trends to help companies think through all aspects of standing up such system. This talk will take the audience through key concepts driving the design of an IoT architecture, discuss typical choices and questions that arise in the process and suggest an approach for successful implementations.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/papleux.jpg"},{"id":4,"name":"AJ Bubb","company":"Accenture, USA","bio":"AJ is the US lead for Accenture’s Wearables and Industrial Internet of Things practices. He brings over a decade of experience in a variety of industries such as finance, oil & gas, mining and resources, retail, and entertainment. Formally CTO of a Philadelphia-based entertainment company, AJ has worked with local startups to Fortune 100 enterprises, delivering innovative, transformational projects.","session_title":"Rise of the Connected World","session_text":"During this session, we will explore the different areas where IoT can provide value, and discuss how leveraging wearables is helping transform the way we do business, and building the workforce of the future. We will look at various use cases, as well as some real world deployments and the positive effects these projects have had in the areas of cost and labor reduction, customer conversion, and safety.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/bubb.jpg"},{"id":5,"name":"Tomas Volek","company":"Accenture, Slovaki","bio":"","session_title":"","session_text":"","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/volek.png"},{"id":6,"name":"Maynard Williams","company":"Accenture, UK","bio":"","session_title":"'The Programmer is Dead’, and Other Antipatterns of Large-Scale Development","session_text":"","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/williams.jpg"},{"id":7,"name":"Wojciech Furmankiewicz","company":"Red Hat, Poland","bio":"Wojciech is looking after Presales Organization in CEE Region. Responsible for supporting sales process, focusing on infrastructure technologies like cloud, virutalization and storage. For many years involved mainly in support and development of mission critical systems. Committed open source enthusiast and advocate. Passionate also about music and motorcycles.","session_title":"Build and Manage Your Hybrid Cloud with Red Hat","session_text":"How to build and manage your heterogeneous virtual infrastructure efficient way? How to start your cloud journey without making a revolution in your Data Center and your IT budget? How to open new options for the unpredictable future dynamics, while protecting your current IT investment? There are more questions to be asked. Red Hat - the open source leader in Hybrid Cloud Management solution reveals the simple answers.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/furmankiewicz.jpg"},{"id":8,"name":"Matt Lancaster","company":"Accenture, USA","bio":"Matt is a senior manager in Accenture's Emerging Technologies Innovation practice supporting the Lightweight Architectures initiative, where he serves as a SME on Web architecture, dynamic languages, Responsive Web Design, and fresh-from-the-startup-space emerging Web technologies and platforms. Matt has recently been at Disney, where he led development and architecture work on major Web properties, and AT&T, where he designed an event-based system to capture and enrich API call metadata. His experience prior to Accenture includes serving as CTO\/Lead Developer at two software startups (one focused on Web platforms for marketing, the other commodities trading platforms), building and delivering Web-enabled learning management platforms for major universities, and other technology consulting roles.","session_title":"","session_text":"","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/Lancaster_sp.jpg"},{"id":9,"name":"Jiri Kolar","company":"Red Hat","bio":"Red Hat Middleware Solution Architect for CEE region. He helps customers and partners to adopt Red Hat technologies for Application layer, Integration, BPM and PaaS. His background from previous engagements is BPM and Integration.","session_title":"Microservices, PaaS and the Red Hat vision","session_text":"We see massive shift to containerization in both on-premise environments and public cloud. The spotlight is on automation of container life-cycle and orchestration of containerized deployments. Modern PaaS such as OpenShift enables efficient scaling and load balancing of containerized applications hence it calls for revision of application architecture. Many Microservice Architecture prerequisites are provided in modern PaaS out of the box. We will discuss how to develop Microservices in OpenShift.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/kolar.jpg"},{"id":10,"name":"Alina Catalina Banuleasa","company":"Google Developer Expert, Romania","bio":"Alina has an extensive experience in UX, currently managing the digital experience for Vodafone young prepaid users. She is the person behind the appreciated ING Bank’s internet banking and she also coordinated innovative digital campaigns for 3 years, making ING one of the most loved Romanian brands in social media.Alina is also a UX trainer, mentor and advocate of design thinking approach. She leads the Women Techmakers Chapter by Google Developers Group in Romania and she is dedicated to developping and supporting the tech communities.","session_title":"Why UX? No, Really, Why UX?","session_text":"Thousands of apps are published daily. As well those vying for your attention, there are websites, cars, TVs, AR, VR...well, you pretty much get the idea. In a world where there are so many options, most people will use only what delivers the best experiences. This session will tackle the frequently questions around user experience including: What is user experience? Why do you need it? How and why some startups succeed and other fail?","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/catalina.jpeg"},{"id":11,"name":"John Rhoton","company":"Accenture, Austria","bio":"John Rhoton is a Senior Principal at Accenture specialized in the adoption of cloud technologies at service providers and multinational corporations. He has over twenty years experience in IT, is a frequent speaker, and has published seven books on emerging technologies.","session_title":"Adopting AWS in the Enterprise","session_text":"This session will cover the enterprise adoption of cloud computing based on Amazon Web Services. It will identify the most common challenges and illustrate how these can be addressed to provide secure, scalable, reliable and high-performing solutions.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/rhoton.png"},{"id":12,"name":"Oscar Renalias","company":"Accenture, Finland","bio":"Oscar is a Senior Technology Architect in Accenture’s Emerging Technology Practice. He’s also globally responsible for all container efforts at Accenture, driving thought leadership as well as delivery across clients and industries.","session_title":"Accelerating Business with Structured Container Delivery","session_text":"Nowadays the entry barrier to Docker and containers is rather low. However, it takes a lot more to design, build and run an entire container platform, at scale, for production applications. This talk will focus on why it is important to have a well-defined model for building application platforms based on container technologies, that guides engineers and architects through the process of identifying platform concerns, patterns, components as well as the interactions between them in order to deliver a set of platform capabilities (service discovery, load balancing, security, and others) to support containerized applications using existing tooling. We will also see how this structure approach has been used to deliver real-world implementations.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/Renalias_sp.jpg"},{"id":13,"name":"Jorge Hidalgo","company":"Accenture, Spain","bio":"Jorge is the Global Java Professional Community Lead in Accenture, and the Custom Distributed, Java, Architecture and DevOps Lead in the Accenture Delivery Center in Spain. In these roles, he drives Java technology agenda in terms of professional community, asset research and development, tools, methodology, architecture, training, certifications and relationships with vendors, as well as leading projects in their adoption of cutting edge technologies and architectures.","session_title":"Lightweight Java Architecture","session_text":"For some time Java technology was synonym for big, complex applications running in large and expensive middleware. However, during the last few years Java technology has experienced a silent revolution towards more lightweight, distributed applications. During this session we will show how Java is pioneering in the new architectural trends, exploring key principles like REST\/lightweight APIs, right-sized services, serverless architectures, Jars-not-wars or polyglot programming.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/hidalgo.jpg"},{"id":14,"name":"Tomas Weber","company":"Accenture, Slovakia","bio":"Senior Manager, Agile Coach and Scrum Trainer (Bratislava, Slovakia, GDN) [PSMI, PSDI, PST].","session_title":"Transforming a 25,000+ Person Consulting Company to Become More Agile","session_text":"Over the past 4 years, Avanade has embarked on a journey to increase their organization’s agility while also building an enterprise-level agile capability to better serve their clients. During this time, Avanade joined Scrum.org as a partner in principle to support these initiatives. In this session, Karel Deman, global DevOps and agile TC lead at Avanade, and Tomas Weber, GDN DevOps and agile TC lead, will describe how Avanade improved their organizational agility. They will also share the successes and challenges Avanade faced in scaling ability across the enterprise to best deliver solutions to their clients using Scrum and agile practices.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/weber.png"},{"id":15,"name":"Karel Deman","company":"Accenture, UK","bio":"Senior Director at Avanade, Global Program Lead for Agile (London, United Kingdom, Europe) [PSMI, PSDI, PST, Engagement Manager, SPC].","session_title":"Transforming a 25,000+ Person Consulting Company to Become More Agile","session_text":"Over the past 4 years, Avanade has embarked on a journey to increase their organization’s agility while also building an enterprise-level agile capability to better serve their clients. During this time, Avanade joined Scrum.org as a partner in principle to support these initiatives. In this session, Karel Deman, global DevOps and agile TC lead at Avanade, and Tomas Weber, GDN DevOps and agile TC lead, will describe how Avanade improved their organizational agility. They will also share the successes and challenges Avanade faced in scaling ability across the enterprise to best deliver solutions to their clients using Scrum and agile practices.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/deman.png"},{"id":16,"name":"Tomi Vanek","company":"Piano, Slovakia","bio":"Tomi is lead architect in Piano with 25 years of experience. Unconventional viewpoint and creative solutions enable him to reveal patterns, idioms and structure in complex systems and technologies, and to understand trends in ecosystem of immature and fast evolving emerging technologies. Tomi is author of open source wsdl-viewer and co-author of expert system for grapevine protection GALATI vitis.","session_title":"React with Redux in Practice","session_text":"Technologists developing libraries, frameworks and tools show trivial examples of technology usage in didactically simplified perspective. The naive adoption of tutorial-based solutions does not scale in professional development of new software products. We will share our experience from developing a new product - medium sized single page analytics application in React and Redux with lightweight server in Node packed into Docker containers for development, testing and production deployment.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/Vanek_sp.jpg"},{"id":17,"name":"Mathias Frey","company":"ERSTE Group, Austria","bio":"Mathias is one of the key persons behind GEORGE - New Digital Banking platform of Erste Group, that will be launched as well to Slovak market in Slovenska Sporitelna in the Q1\/17. Mathias is the lead architect and manager of analyst team.","session_title":"Scalable Architecture for a New Age of Banking","session_text":"In ERSTE we build GEORGE, a new Digital Platform that we are rolling out across our banking group. We use cutting edge technology at a massive scale in order to drive top customer experience and enable fast integration of business ideas and fintech collaboration. Mathias will share insights of technology that enables the key product features.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/frey.jpg"},{"id":18,"name":"Jan Gregor","company":"mimacom, Slovakia","bio":"","session_title":"Introducing Liferay DXP - from Portal to Platform","session_text":"This talk is focused on the new platform – Liferay DXP and introduces its 15 most important innovations, in terms of product, framework and development process.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/gregor.png"},{"id":19,"name":"Milen Dyankov","company":"Liferay, Poland","bio":"","session_title":"Introducing Liferay DXP - from Portal to Platform","session_text":"This talk is focused on the new platform – Liferay DXP and introduces its 15 most important innovations, in terms of product, framework and development process.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/Dyankov.jpg"},{"id":20,"name":"Veronica Arama","company":"Accenture","bio":"Veronica based in Cluj-Napoca, Romania, she has currently OSS Governance Capability Lead role, having 6+ years of experience in OSS governance programs. She is a graduate of Technical University, Electronics & Telecommunications faculty from Cluj.","session_title":"OSS Governance @Accenture","session_text":"The presentation will reveal the importance of having a robust Open Source Governance and how can this support the use and contribution to OSS, how Accenture is embracing OSS and how the usage of OSS can drive Innovation.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/arama.jpeg"},{"id":21,"name":"Ezio Armando","company":"Accenture, France","bio":"Ezio Armando is the Global Managing Director of Accenture's Architecture Excellence practice. He has over 23 years of IT experience as Enterprise, Technology and Solutions Architect, 16 of which for Accenture, specializing in IT strategy and in shaping, planning, designing and delivery of high-availability, high-security, high-volume systems for some of the largest Accenture clients.","session_title":"Design Thinking and Design Doing for Enterprise Solutions","session_text":"","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/armando.jpg"},{"id":22,"name":"Ashley Benigno","company":"Fjord, Italy","bio":"","session_title":"Design Thinking and Design Doing for Enterprise Solutions","session_text":"","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/benigno.jpg"},{"id":23,"name":"David Szorad","company":"Accenture, Slovakia","bio":"I am a Software Engineering Analyst at Accenture Bratislava working and focusing on Microsoft technology (ASP.NET, Sitecore, Xamarin) and thanks to current project I am working AngularJS as well (combination of Sitecore, ASP.NET MVC and Angular JS). I am also a Certified Sitecore Professional Developer and most of my projects include Sitecore, however it usually comes with using other technologies and Xamarin is one of them.","session_title":"Mobile Applications Development with Xamarin","session_text":"Introduction to mobile applications development from a perspective of targeting multiple platforms. Comparison among native app development, Xamarin and other multiplatform solutions. Focus will be taken on Xamarin, it's architecture and practical use.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/szorad-david.jpg"},{"id":24,"name":"Vladimir Hudec","company":"CSOB, Slovakia","bio":"Vlado has over 7 years of experience in mobile application development. He has experiences as senior developer and Mobile Solutions Architect for KBC Mobile Centre of Excellence","session_title":"How to Run OpenCV on Mobile and Use It for Image Pre-processing (OCR)","session_text":"In the talk we will explain the case study from an OCR payment form scanning, used by several institutions within KBC group.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/hudec.jpg"},{"id":25,"name":"Ivan Patacik","company":"CSOB, Slovakia","bio":"","session_title":"How to Run OpenCV on Mobile and Use It for Image Pre-processing (OCR)","session_text":"In the talk we will explain the case study from an OCR payment form scanning, used by several institutions within KBC group.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/patacik.jpg"},{"id":26,"name":"Martin Culen","company":"Accenture, Slovakia","bio":"Martin is Technology Architect from Accenture's Danubia Delivery Center. During his career, he was working mostly on integration technologies (Oracle SOA Suite, Red Hat JBoss Fuse) in Telco industry. Recently he focused on open source big data technologies like Apache Spark, Apache Kafka and others.","session_title":"Spark Streaming","session_text":"In this session, we'll compare streaming engines like Apache Spark Streaming, Flink, Samza, Storm. In the second part, we'll focus on Spark Streaming, explain solution we've built on top of Spark Streaming and also have a look on our Spark Streaming performance tuning.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/culen.jpg"},{"id":27,"name":"Andrea Ubbiali","company":"Red Hat","bio":"With more than twenty years of experience as a technologist for companies like BEA- Weblogic, CA- Wily, Lombardi\/IBM and Red Hat, Andrea has extensive experience in enterprise software and middleware, in particular application servers, business process automation, and application management, liaising customers and partners with product teams to foster the adoption of new technologies.","session_title":"Polyglot Lightweight Architectures: a Red Hat Perspective","session_text":"Enterprise solutions cannot rely on a single runtime technology, successful software businesses like Netflix and Google tend to rely on a unified polyglot stack. Where does the Node.js runtime add most value in an Enterprise technology stack? Challenges while using Node.js in the enterprise and ways to address them. Reference architectures for running node.js in an Enterprise technology stack. Red Hat enablers for node.js based lightweight architectures: Openshift and Mobile Application Platform.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/unknown.jpg"},{"id":28,"name":"Philipp Fehre","company":"Microsoft\/Yammer, UK","bio":"Philipp is a software developer at Microsoft working on Yammer, author of 'JavaScript Domain-Driven Design', speaker and conference organizer. As a consultant he has been extracting services for years, and as a NoSQL evangelist worked with companies and developers evolving the best storage fit for their system.","session_title":"Microservices, More Than Just a Small Codebase","session_text":"You split a monolith? Welcome to the world of distributed systems and managing many applications. How do you reap the benefits of Microservices without drowning in a managing nightmare? How do you built and application composed of many applications without forfeiting stability? How do you develop stable code bases without creating just another legacy system. At Yammer we are running more than 30 services as part of our main production application and the number is growing, so let me tell you our story.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/fehre.jpg"},{"id":29,"name":"Pavol Kovalcik","company":"Accenture, Slovakia","bio":"Joined Accenture in 2004. Responsible for Accenture Visual Analytics capability in Danubia region (Slovakia, Czech rep, Romania, Hungary).","session_title":"Visual Analytics is the New Sexy","session_text":"Introduction to the world of visual analytics. How to better understand and leverage data in the digital era? Show cases to picture how the new generation VA tools in a combination with open source technologies can bring up new user experience and enable business to gain a more comprehensive and flexible insight to their business problems and opportunities.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/kovalcik.jpg"},{"id":30,"name":"Marian Hrubizna","company":"Accenture, Slovakia","bio":"","session_title":"Visual Analytics is the New Sexy","session_text":"Introduction to the world of visual analytics. How to better understand and leverage data in the digital era? Show cases to picture how the new generation VA tools in a combination with open source technologies can bring up new user experience and enable business to gain a more comprehensive and flexible insight to their business problems and opportunities.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/hrubizna.png"},{"id":31,"name":"Roman Gavuliak","company":"Piano, Slovakia","bio":"Roman Gavuliak holds a PhD in applied statistics and currently works as a Lead Data Scientist in Piano - a company focused on deriving value from online content.The aim of data science in Piano is to provide data driven actionable insights for over 1200 clients including sites such as CNBC, Newsweek and locally SME or .týždeň.Roman is also the organizer of Banalytics meetup focused on analytical community in Slovakia and a MeasureCamp Slovakia organizer.","session_title":"Machine Learning Learnings","session_text":"Machine Learning is at the peak of its popularity and we feel the debate revolves too much about the techniques being used. Most of the real knowledge comes from experience with dirty data. We would like to share with you our approach to ML topics. We do not claim to know it all, but we hope to provide concrete tips on what to try when stuck as well as on the dangers along the your way.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/gavuliak.jpg"},{"id":32,"name":"Michal Barla","company":"FIIT STU & Luigisbox, Slovakia","bio":"Michal is a teacher and researcher at FIIT STU, with focus on data analysis and machine learning. He participated on several research projects revolving around web usage analysis for the purposes of web adaptation and personalization. Recently he co-founded Luigisbox, actionable site search analytics service for online entrepreneurs. Michal is a co-organizer of regular meetups of programmers in Bratislava - Rubyslava.","session_title":"Machine Learning Learnings","session_text":"Machine Learning is at the peak of its popularity and we feel the debate revolves too much about the techniques being used. Most of the real knowledge comes from experience with dirty data. We would like to share with you our approach to ML topics. We do not claim to know it all, but we hope to provide concrete tips on what to try when stuck as well as on the dangers along the your way.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/barla.jpg"},{"id":33,"name":"Steven Thwaites","company":"Docker, UK","bio":"Steven works in Solutions Engineering at Docker in London, and works with its customers and partners across Europe to aid adoption of Docker's technology.","session_title":"What's New in Docker?","session_text":"Docker is at the centre of an emerging, fast-moving domain of technology – containers. Beyond the buzz, there is great functionality available in the projects and ecosystem and the rate of adoption is extraordinary. How are enterprises benefiting and through what methods? This talk will introduce Docker concepts and give details of the latest innovation in the space. By the end, you will know how to get the most from adopting Docker at each phase of software development – Build, Ship and Run.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/thwaites.jpeg"},{"id":34,"name":"Slavomir Kubacka","company":"Accenture, Slovakia","bio":"Slavomir is a Software Engineer at Accenture. He is part of Accenture's Lightweight Architecture practice group with experience in JavaScript & NodeJS. Currently he is working on next generation banking application.","session_title":"Alexia: From Web Apps to Voice Apps","session_text":"Voice interaction with computer is becoming part of our life. Personal digital assistants like Alexa (Amazon), Siri (Apple), Cortana (Microsoft) and Ok, Google (Google) lives on our phones, tablets, computers, home electronics and wearable devices. In this talk we will focus on Alexa on Amazon Echo device and how to add new voice app (skill) to it using your existing modern web development skill set (JavaScript and NodeJS).","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/Kubacka_sp.jpeg"},{"id":35,"name":"Michael Gloger","company":"Accenture, Slovakia","bio":"Michael Gloger is a software engineer from Accenture working with modern web technologies. He is a contributor to Alexia framework and helped to support launch of new Accenture Liquid Application Studio office in Silicon Valley.","session_title":"Alexia: From Web Apps to Voice Apps","session_text":"Voice interaction with computer is becoming part of our life. Personal digital assistants like Alexa (Amazon), Siri (Apple), Cortana (Microsoft) and Ok, Google (Google) lives on our phones, tablets, computers, home electronics and wearable devices. In this talk we will focus on Alexa on Amazon Echo device and how to add new voice app (skill) to it using your existing modern web development skill set (JavaScript and NodeJS).","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/gloger.png"},{"id":36,"name":"Tim Zallmann","company":"ERSTE Group, Austria","bio":"Tim is the Front End development lead behind GEORGE, the new Digital Banking platform of ERSTE Group that is being rolled out across the group including Slovenska Sporitelna in Q1 2017.","session_title":"JS Plugins - Future of Internet Banking customization","session_text":"","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/zallmann.jpg"},{"id":37,"name":"Siegfried Goeschl","company":"ERSTE Group, Austria","bio":"Siegfried is one of our key back-end developers for GEORGE the new Digital Banking Platform of Erste Group. In his spare time he participates at the ASF (Apache Software Foundation) contributing to Apache Commons, Turbine & JSPWiki.","session_title":"Java Imaging Survival Guide","session_text":"","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/goeschl.jpg"},{"id":38,"name":"Jaroslav Blazek","company":"Accenture, Czech Republic","bio":"Jaroslav is Senior Technology Architect responsible for delivery of large BSS transformations in EALA. He studied Technical Cybernetics & Computer Vision at Czech Technical University in Prague and joined Accenture back in 2000.Jaroslav is focusing on integration platforms and Omni-channel architectures in Telco space being responsible for “Innovative and Lean BSS” campaign within CMT IGEM Digital BSS - Marketing, Sales & Customer Service Business Practice. Jaroslav was responsible for evolution of NOE industrialized asset awarded as “Red Hat Most Innovative Project of the Year 2013” and it’s evolution awarded as “ Red Hat Project of the Year 2014” in CEE.","session_title":"Open Digital Journey","session_text":"Implementation of complex BSS stack for T1 Telco using RedHat Open Source Platforms and further Industrialization. Client experience with omni-channel, multispeed Enterprise wide architecture with accent on reusability. Liquid approach for delivery of BSS Accelerator stack for different Industry Verticals (Finance\/Insurance).","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/blazek.jpg"},{"id":39,"name":"Regis Allegre","company":"Accenture, France","bio":"After more than 10 years in the technology architecture and delivery domain at Accenture, I spent a few years in CTO\/VP Engineering roles in smaller companies. I am now back to Accenture in Emerging Technology to develop the Software Engineering Innovation domain in EALA. Based in Paris, I care about Lightweight Architectures, Open Source, Cloud and DevOps.","session_title":"Lean Engineering Applied","session_text":"","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/regis.jpg"},{"id":40,"name":"Martin Lofaj","company":"Accenture, Slovakia","bio":"","session_title":"Lean Engineering Applied","session_text":"","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/Lofaj_sp.jpeg"},{"id":41,"name":"Milan Unger","company":"Siemens Healthcare sro, Slovakia","bio":"Lead Architect for the department of syngo Imaging Development Center at Siemens Healthcare sro Slovakia. More than 17 years of professional praxis on international and huge software projects for various industrial sectors using broad range of technologies and approaches. Post-graduated at Military Academy of Slovak Republic in Artificial Intelligence subject.","session_title":"Cloud and Visualization of Medical Image Data","session_text":"Modern medical imaging deals with huge datasets of volumetric data acquired by high precision scanning of human body through computer tomography or magnetic resonance. Visualization of the data frequently requires specialized hardware and specific algorithms to enable physicians and radiologist to provide correct diagnosis. Is technology ready for that? What are benefits and challenges for such approach? Where the cloud brings its real value for medical imaging?","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/unger.jpg"},{"id":42,"name":"Thomas Michelbach","company":"Accenture, Germany","bio":"Thomas is Senior Technology Architect at Accenture with particular expertise in Java solutions. He is a member of the Accenture Architecture Innovation team, which focuses on innovative solutions around cloud computing, business process management, software development lifecycle, and other emerging technologies. Thomas has 7 years of technology architecture experience across a variety of industries like: Financial Services, Public Services and Telecommunications. He has background in Cloud Computing with Platform as a Service and Infrastructure as a Service, as well as Web and Integration Architecture experience, always with a Java touch.","session_title":"Discussion Board - Moderator Thomas Michelbach","session_text":"","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/michelbach.jpg"},{"id":43,"name":"Rastislav Rehak","company":"mimacom, Slovakia","bio":"","session_title":"What’s Hot and New in Elastic?","session_text":"Talk will introduce the history and current state of Elastic stack’s components - Elasticsearch, Kibana, Logstash and Beats. We will showcase the latest features of Elastic 5, that should be released in October and we will compare improvements with the current version.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/rehak.png"},{"id":44,"name":"Ludovit Hajzer","company":"mimacom, Slovakia","bio":"","session_title":"Tour of Heroes Workshop with AngularJS 2.0","session_text":"","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/hajzer.png"},{"id":45,"name":"Lukas Eichler","company":"Accenture, Germany","bio":"Lukas Eichler is a Software Engineering Analyst at Accenture Digital in Germany working on cloud architectures based on Container technologies like Kubernetes and Docker. He is also part of the in-memory technologies capability inside Accenture pushing the in-memory technologies in order to provide high performant distributed computing and analytics solutions.","session_title":"In Memory Data Grids Hands on Introduction Using Apache Ignite","session_text":"What are In Memory Data Grids? Why and when to use in Memory Data Grids? How to use Data Grids for parallel computing, aggregation of data and stream processing? Live Demonstration.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/eichler.jpeg"},{"id":46,"name":"Christian Muuß","company":"Accenture, Germany","bio":"","session_title":"In Memory Data Grids Hands on Introduction Using Apache Ignite","session_text":"What are In Memory Data Grids? Why and when to use in Memory Data Grids? How to use Data Grids for parallel computing, aggregation of data and stream processing? Live Demonstration.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/muuss.jpg"},{"id":47,"name":"Milan Rubes","company":"Goodea, Czech Republic","bio":"Enterprise architect and trainer. Milan is helping customers to apply the best from the architecture standards in their daily business. Leaving all the theoretical and abstract things behind. When worked for the biggest companies in the region, he learnt a lot about helpful and wrong approaches to architecture management.","session_title":"Agile Architecture","session_text":"Agile approach to development is very popular by many companies of all sizes. Following this approach architecture may be perceived as a discipline that slows down the whole environment and is not agile at all. Is it only the perception? Is the problem in architecture or its frameworks? Or us - architects? Do we design architecture in agile way or for agile organisations? Do the popular architecture frameworks support agile approach?","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/rubes.png"},{"id":48,"name":"Dusan Hlavaty","company":"Piano, Slovakia","bio":"Director of client engineering and lead frontend developer at Piano.","session_title":"Fundamentals of React with Redux","session_text":"Developers creating single-page, stateful applications has a lot of challenge to overcome. The whole 'frontend world' is talking about Redux and FLUX and React these days. What are they? Redux is a predictable state container for JavaScript apps. Complicated? No worries, Redux is incredibly simple. This workshop is will learn the basics of React with Redux, build an web application and see some practical production ready techniques for building your applications.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/hlavaty.jpg"},{"id":49,"name":"Marek Jelen","company":"Red Hat","bio":"Marek currently works as a Developer Advocate at Red Hat, where his task is to introduce PaaS to engineers, architects, etc. Before joining Red Hat Marek worked as a Ruby, PHP and Java engineer and consultant.","session_title":"OpenShift Enterprise by Red Hat: the Container Platform That Provides the Power of Docker and the Kubernetes Cluster Manager Optimized for Enterprise App Development and Deployment","session_text":"","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/jelen.jpg"},{"id":50,"name":"Juraj Sotnik","company":"Piano, Slovakia","bio":"Juraj is team leader with experience in various programming languages with focus on quality of code and teamwork. He has been designing and building systems with a high number of requests during his career. Juraj is also dev-ops enthusiast and a speaker at local meetups.","session_title":"Go Lang - Make Software Development Enjoyable Again","session_text":"","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/juraj_sotnik.png"},{"id":51,"name":"Peter Molnar","company":"Accenture","bio":"Peter is based in Cluj-Napoca, Romania, he graduated Psychology from Babes-Bolyai University and is currently enrolled to obtain a BA in Economic Informatics. He is leading one of the OSS governance teams performing compliance activities for one of our customers. He has more than 4 years’ experience in this domain.","session_title":"OSS Governance @Accenture","session_text":"The presentation will reveal the importance of having a robust Open Source Governance and how can this support the use and contribution to OSS, how Accenture is embracing OSS and how the usage of OSS can drive Innovation.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/molnar.jpg"},{"id":52,"name":"Michal Pohorely","company":"Accenture, Czech Republic","bio":"","session_title":"Security Threat Hunting and the Accenture Cyber Intelligence Platform","session_text":"We will discuss the concepts and requirements behind Threat Hunting in today’s complex cyber security landscape and demo the Accenture Cyber Intelligence Platform.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/pohorely.jpg"},{"id":53,"name":"Tomas Smid","company":"Accenture","bio":"","session_title":"Security Threat Hunting and the Accenture Cyber Intelligence Platform","session_text":"We will discuss the concepts and requirements behind Threat Hunting in today’s complex cyber security landscape and demo the Accenture Cyber Intelligence Platform.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/smid.jpg"},{"id":54,"name":"Peter Dulacka","company":"Piano, Slovakia","bio":"Peter Dulacka is a graduate from FIIT STU. He worked on projects in PHP and Ruby on Rails and started with Go a year ago. He claims he wouldn't go back.","session_title":"Go Lang - Make Software Development Enjoyable Again","session_text":"","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/peter_dulacka.jpg"},{"id":55,"name":"Marek Hornak","company":"mimacom, Slovakia","bio":"","session_title":"Building Modular OSGi Applications with Liferay DXP","session_text":"","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/unknown.jpg"},{"id":56,"name":"Stanislav Harvan","company":"Microsoft, Slovakia","bio":"Stanislav is a Technical Evangelist in Microsoft focusing in Azure cloud services. With a solid technical background, and having gained experience on various Open Source projects before, he has helped numerous customers to embrace Open Source. He is an enthusiast that loves everything about data including data analysis, Business Intelligence and Machine Learning.","session_title":"Azure Services in IoT Architecture","session_text":"This session will focus on key concepts driving the design of an IoT architecture, discuss typical choices and suggest an approach for designing successful IoT backend implementations. The audience will get an overview of Azure services supporting end-to-end IoT scenario including collecting IoT data, processing it and presenting it real-time.","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/harvan.jpeg"},{"id":57,"name":"Chad Mott","company":"Accenture, USA","bio":"Technology Architect Manager within Emerging Technology. Based in St. Louis, Missouri, Chad is currently working on a DevOps and platform rearchitecture project. He leads up the LWA NodeJS architecture group, is an AWS Certified Solution Architect, and TypeScript proponent.","session_title":"Typescript from the Ground Up","session_text":"","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/mott.jpg"},{"id":58,"name":"Eddie Garcia","company":"Accenture, USA","bio":"","session_title":"Modern Web Academy - Fundamentals","session_text":"","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/garcia.jpg"},{"id":59,"name":"Dominika Hurajtova","company":"Accenture, Slovakia","bio":"","session_title":"Modern Web Academy - Fundamentals","session_text":"","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/hurajtova.jpg"},{"id":60,"name":"Daniel Derevjanik","company":"Accenture, Slovakia","bio":"","session_title":"Typescript from the Ground Up","session_text":"","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/derevjanik.jpg"},{"id":61,"name":"Jacek Skorzynski","company":"Red Hat","bio":"Working at Red Hat as Solution Architect. Responsible for supporting sales process on infrastructure technologies such as cloud, virtualization and storage. Previously gained practical experience on various cloud technologies, virtualization platforms, storage and server solutions. Involved mainly in support and development of mission critical systems. Hobby: Raspberry PI projects and volleyball (watching and playing).","session_title":"Ansible Tower by Red Hat - the Best Way to Run Ansible at Large Scale in Your Organization","session_text":"","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/skorzynski.jpg"},{"id":62,"name":"Martin Noskovic","company":"Accenture, Slovakia","bio":"","session_title":"DevOps Using Microsoft Azure & Visual Studio Team Services","session_text":"","picture":"http:\/\/www.openslava.sk\/2016\/assets\/img\/speaker\/noskovic.jpg"}]}